package com.kova;

/**
 * Создать класс, описывающий банкомат.
 * Банкомат задается тремя свойствами:
 * - количеством купюр номиналом 20, 50 и 100.
 *
 * Сделать методы для добавления денег в банкомат.
 *
 * Сделать метод, снимающий деньги: он принимает сумму денег,
 * а возвращает булево значение - успешность выполнения операции.
 *
 * При снятии денег метод должен распечатывать каким количеством купюр какого номинала выдаётся сумма.
 *
 * Создать конструктор с тремя параметрами - количеством купюр каждого номинала.
 */
public class AtmRunner {
    public static void main(String[] args) {

    ATM atm = new ATM(20,29,22);
        atm.withdrawal(4,2,3);
        atm.replenishment(3,5,2);

    }
}
